modules/api/controllers/PatientsController.php

     public function actionListPatients()
     {
         \Yii::$app->response->format = Response::FORMAT_JSON;
         $model = Patients::find()->all();
---
SELECT * FROM `patients`